build/resources/test/xmldata/test/calculatorArray.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Add>
         <tem:intA>3</tem:intA>
         <tem:intB>2</tem:intB>
      </tem:Add>
      <tem:Add>
         <tem:intA>5</tem:intA>
         <tem:intB>6</tem:intB>
      </tem:Add>
   </soapenv:Body>
</soapenv:Envelope>